README UPDATED WITH ARCHIECTURE DIAGRAM - 2
